## import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
data = pd.read_excel(r'C:\Users\valen\Documents\Scolaire\Centrale Lyon\2a\PAi\Pai24\Python-Machine-Learning-master\titanic3.xls')

In [50]:
data.head()
data = data.drop(["pclass","name","sibsp","parch","ticket","fare","cabin","embarked","boat","body","home.dest"],axis=1)

In [51]:
data = data.dropna(axis=0) #attention cela retourne le df sans les nan mais ne l'applique pas au tableau originel
data.describe()

          survived          age
count  1046.000000  1046.000000
mean      0.408222    29.881135
std       0.491740    14.413500
min       0.000000     0.166700
25%       0.000000    21.000000
50%       0.000000    28.000000
75%       1.000000    39.000000
max       1.000000    80.000000

In [59]:
#exos: création des catégories en remplacant l'âge:
data.loc[data['age']<=20,'age']=0
data.loc[(data['age']>20)&(data['age']<=30),'age']=1
data.head()

In [60]:
data.head()

   survived     sex  age
0         1  female  1.0
1         0       0  0.0
2         0       0  0.0
3         0    male  1.0
4         0  female  1.0